.. _nir_userguide:

French Personal Identification Numbers
======================================

Introduction
------------

The function :func:`clean_fr_nir() <dataprep.clean.clean_fr_nir.clean_fr_nir>` cleans a column containing French personal identification number (NIR) strings, and standardizes them in a given format. The function :func:`validate_fr_nir() <dataprep.clean.clean_fr_nir.validate_fr_nir>` validates either a single NIR strings, a column of NIR strings or a DataFrame of NIR strings, returning `True` if the value is valid, and `False` otherwise.

NIR strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "295109912611193"
* `standard`: NIR strings with proper whitespace in the proper places, like "2 95 10 99 126 111 93"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_fr_nir()` and `validate_fr_nir()`.

### An example dataset containing NIR strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nir": [
            "295109912611193",
            "253072C07300443",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

               nir                                           address
0  295109912611193                                     123 Pine Ave.
1  253072C07300443                                           main st
2      51824753556                      1234 west main heights 57033
3   51 824 753 556                    apt 1 789 s maple rd manhattan
4            hello                robie house, 789 north main street
5              NaN  (staples center) 1111 S Figueroa St, Los Angeles
6             NULL                                             hello

## 1. Default `clean_fr_nir`

By default, `clean_fr_nir` will clean nir strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_fr_nir
clean_fr_nir(df, column = "nir")

,nir,address,nir_clean
0,295109912611193,123 Pine Ave.,2 95 10 99 126 111 93
1,253072C07300443,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_fr_nir(df, column = "nir", output_format="standard")

,nir,address,nir_clean
0,295109912611193,123 Pine Ave.,2 95 10 99 126 111 93
1,253072C07300443,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_fr_nir(df, column = "nir", output_format="compact")

,nir,address,nir_clean
0,295109912611193,123 Pine Ave.,295109912611193
1,253072C07300443,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NIR strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_fr_nir(df, column="nir", inplace=True)

               nir_clean                                           address
0  2 95 10 99 126 111 93                                     123 Pine Ave.
1                    NaN                                           main st
2                    NaN                      1234 west main heights 57033
3                    NaN                    apt 1 789 s maple rd manhattan
4                    NaN                robie house, 789 north main street
5                    NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                    NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_fr_nir(df, "nir", errors="coerce")

,nir,address,nir_clean
0,295109912611193,123 Pine Ave.,2 95 10 99 126 111 93
1,253072C07300443,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_fr_nir(df, "nir", errors="ignore")

,nir,address,nir_clean
0,295109912611193,123 Pine Ave.,2 95 10 99 126 111 93
1,253072C07300443,main st,253072C07300443
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_fr_nir()`

`validate_fr_nir()` returns `True` when the input is a valid NIR. Otherwise it returns `False`.

The input of `validate_fr_nir()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_fr_nir()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_fr_nir()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_fr_nir
print(validate_fr_nir("295109912611193"))
print(validate_fr_nir("253072C07300443"))
print(validate_fr_nir("51824753556"))
print(validate_fr_nir("51 824 753 556"))
print(validate_fr_nir("hello"))
print(validate_fr_nir(np.nan))
print(validate_fr_nir("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_fr_nir(df["nir"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nir, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_fr_nir(df, column="nir")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nir, dtype: bool

### Only DataFrame

In [11]:
validate_fr_nir(df)

     nir  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False